import 'package:flutter/material.dart';
import 'package:response_dashboard/widgets/AllExpensesAndQuickInvoice.dart';

import 'package:response_dashboard/widgets/Custom_Drawer.dart';
import 'package:response_dashboard/widgets/Income_Section.dart';

import 'package:response_dashboard/widgets/My_Card_And_Transaction_History.dart';

class DesktopDashboard extends StatelessWidget {
  const DesktopDashboard({super.key});

  @override
  Widget build(BuildContext context) {
    return const Row(
      children: [
        Expanded(
          flex: 1,
          child: CustomDrawer(),
        ),
        SizedBox(
          width: 32,
        ),
        Expanded(
          flex: 2,
          child: AllExpensesAndQuickInvoiceSection(),
        ),
        SizedBox(
          width: 24,
        ),
        // معمول اكسباند للبيدج فيو ف باتالي كل ايتم هيتعملها اكسباند ف هتبقي بالمنظر دا ودي مشكله وهنتكلم عليها
        // وفيه مشكله تانيه ظهرت وهي الباك جراوند بتاعت الكونتينر ف هي عباره عن صوره لها اسبكت راشيو معينه ف لما الاسبكت راشيو الخاص بالكونتينر
        // اختلف    الباك جراوند فضل محتفظ بنفس الاسبكت راشيو ف حص لامنظر دا ف هتلاقي اتربيوت  ف الايمدج اعدله
        //
        //
        //نتكلم ف النقظه المهم بقا ان البيدج فيو  حاططها جوا اكسباندد ف البيهافيو الي حصل دا طبيعي
        // ومش هشيل الاكبساند لان هي المفروض تاكسباند فعلا يعني انا عايزها تاخد الويدث المتاح ليها لكن الفكره كلها ف الهايت بتاع البيدج فيو ف انا عايز الهايت بتاع البيدج فيو
        // يكون مساوي للهايت بتاع الايتم  يعني انا عارض مجموعه من الايتم  وكل ايتم المفروض هتاكسباند الويدث بتاعها وبتحدد الهايت علي اساس الويدث من خلال الاسبكت راشيو
        // ف انا عايز البيدج فيو تاخد الهايت بتاع الايتم بالظبط ايا يكن الهايت بتاع الايتم لان ساعات بشوف فيه هايتس مختلفه
        // ولو معملتش كدا هيحصل مشكله ف هنا المشكله كانت ان الايتم هياكسباند ع الكولم كدا ولكن ف مكان تاني ممكن تلاقي الايتم نفسها ضاربه بسبب ان الهايت صغير
        //  والموضوع دا مر علينا ف الليست فيو وقولتلك ساعتها فيه حلين   اول حل اني احسب الهايت مانوال بتاع كل ايتم وبعد كدا ادي لليست فيو الهايت الخاصه فيها
        // خصوصا ان ع الاغلب الليست فيو بتعرض نفس الايتمز بشكل دائم
        //
        // والحل التاني لو كان عندي ايتمز بعدد محدود ممكن استخدم رو هيبقي افضل ف الحاله دي  لكن حل زي كدا هنا مش سليم  يعني مينفعش استخدم بدل البيدج فيو ب رو ويدجت
        // ف محتاج  استخدم بيدج فيو فعلا ف ممكن بقا استخدم الحل الاول  يعني هحدد الهايت بتتاع الكارد واحطه للبيدج فيو لكن دا حل مش لطيف برده  لان انا قلتلك
        // من شويه ان الكارد المفروض تكون ريسبونسف معايا لان لها اسبكت راشيو ف لو الويدث زاد الهايت يزيد ف باالتالي ف المكان ا مينفعش احدد فيكسد هايت
        // لان لو حددت فيكسد هايت غصبن عني لازم يبقي عندي فيكسد ويدث عشان افضل محافظ علي الاسبكت راشيو
        // ف بما اني محتاج الهايت بتاع الايتم يتغير  ف انا محتاج برده الهايت بتاع البيدج فيو يتغير  ف احلها ازاي ؟
        //  ف انا محتاج حل خاص بالكيز بتاعت البيدج فيو    ف انا عايز البيدج فيو تبقي دايما واخده الهايت بتاع التشايلد حتي لو كان التشايلد دا الهايت بتاعه بيتغير
        // ف حاجه زي كدا محتاج كل ايتم معروضه تقولي الهايت بتاعها واخزن ليست من الهايتس عندي
        // ف انا محتاج بشكل ما اخلي كل تشايلد عندي هنا  يقولي الهايت بتاعه واخزن مثلا  الهايت دا  ف ليست عندي  والمفروض لكل تشايلد
        // قبل ما يتبني يحسبلي  الهايت بتاعه واخزنه ف الليست دي   ف بالتالي ممكن احدد الهايت بتاع البيدج فيو بالشكل دا واديله الهايت بتاع نفس التشايلد المعروضه
        // ف الفكره كلها دلوقتي ازاي بقا ممكن بالفعل اخلي كل ايتم تحسبلي الهايت بتاعها واخزنها ف الليست دي
        // ومعني اني اعمل حاجه زي كدا ف المفروض التشيلدرن دول هيتبنو الاول  وبالتالي مينفعش استخدم دوت بيلدر
        //  لان دوت بيلدر بتبني الايتمز الي معروضين ع الشاشه بس لكن انا مش عايز كدا  انا عايز من البدايه خالص قبل ما يحصل اي حاجه يبقا عندي الهايت بتاع كل تشايلد
        // ف الحل دا هنستخدمه لما يكون عندي عدد محدود من الايتمز لان غير  كدا ممكن تحصل مشكله ف الاداء   بس ف معظم الحالات هتلاقي البيدج فيو بيتم استخدامها
        // مع عدد محدود من الايتمز
        // ف دلوقتي مهتمين ازاي نعرف  نخلي كل تشايلد يحسب الهايت بتاعه ولو دخلنا اتكلمنا ف النقطه دي  هنتكلم ف حاجات كتير  ف بالتالي ف الحل دا خصوصا افضل حل نستخدم باكدج
        // افضل واسرع
        // والحل دا ممكن نستخدمه مع الليست فيو برده ع فكره  لكن لو عملتها بالنسبه لليست ملهاش لازمه لان عندك الرو ف تعب الفاضل والرو بيقضي الغرض دا
        // وانت هنا بتعمل نفس الموضوع بتجنريت مجموعه من التششيلدرن بتوعك يعني كلهم بيتبنو مره واحده الاول ف كانك عملت رو اساسا   طبعا بتكلم ف حاله طبقنا الحل دا مع الليست فيو
        // ف هنبقي عقدنا الموضوع اكتر

        // Expanded(child: MyCardPageView())
        // CustomDotIndator(isActive: true),
        Expanded(
            child: Column(
          children: [
            SizedBox(
              height: 40,
            ),
            MyCardAndTransactionHistorySection(),
            SizedBox(
              height: 24,
            ),
            Expanded(child: IncomeSection())
          ],
        )),
      ],
    );
  }
}
