import 'package:flutter/material.dart';
import 'package:response_dashboard/models/User_Info_Model.dart';
import 'package:response_dashboard/utils/App_Images.dart';
import 'package:response_dashboard/widgets/User_info_list_tile.dart';

class LatestTransacitonListView extends StatelessWidget {
  const LatestTransacitonListView({super.key});
  static const List<UserInfoModel> items = [
    UserInfoModel(
        image: Assets.imagesAvatar1,
        title: 'Madrani Andi',
        subtitle: 'Madrani@gmail.com'),
    UserInfoModel(
        image: Assets.imagesAvatar2,
        title: 'Madrani Andi',
        subtitle: 'Madrani@gmail.com'),
    UserInfoModel(
        image: Assets.imagesAvatar3,
        title: 'Madrani Andi',
        subtitle: 'Madrani@gmail.com'),
  ];
  @override
  Widget build(BuildContext context) {
    return SingleChildScrollView(
      scrollDirection: Axis.horizontal,
      child: Row(
        mainAxisAlignment: MainAxisAlignment.start,
        children: List.generate(
            items.length,
            (index) => IntrinsicWidth(
                child: UserInfoListTile(userInfoModel: items[index]))),
      ),
    );
    return SizedBox(
      height: 80,
      child: ListView.builder(
        scrollDirection: Axis.horizontal,
        itemCount: items.length,
        itemBuilder: (context, index) {
          return IntrinsicWidth(
            child: UserInfoListTile(
              userInfoModel: items[index],
            ),
          );
        },
      ),
    );
  }
}
// الليست فيو بتحط الويدجتس جنب بعض  وبما انك بتحط الويدجتس جنب بعض ف مفيش واحده ينفع تاخد راحتها
// ف انت هنا حطيت اكتر من ليست تايل جنب بعض  وكل واحده بتحب تاخد راحتها يعني المساحه المتاحه له  يعني يبقي له ويدث محدد عشان يقدر ياخد راحته
// ودا طبعا مش موجود  ف الحل هنا انك تروح تحدد مساحه لليست تايل ف انت محتاج تركز ف القيمه الي هتديها لليست تايل عشان تاخد القيمه بالظبط 
// ولما توصل للقيمه بالظبط دي كدا مشكله برده ليه ؟ لانك حطيت فيكسد ويدث  لان مثلا ممكن حد الايميل بتاعه كبير ف هيعمل مشكله مع الويدث الي انت محدده  ف هتلاقي
// الايميل نزل لتحت   لكن انا عايز الليست تايل تاخد ويدث بما يكفي ان الايتم دي الايميل بتاعها يتعرض بشكل سليم  وف لاين واحد  خصوصا انك حاطط ليست فيو
// ف المفروض انها بتسكرول  ف المفروض تاخد الويدث الي انت عايزه  حرفيا  ف انا عايز الايتم تاخد الويدث الي هي عايزاه
// ف دي حاجه ريسبونسف يعني محتاج   قيمه الويدث تبقي متغيره عشان  تخلي الانترفيس يتصرف ويبقي ريسبونسف  مع البيانات 
//ف هننتكلم ف موضوع الانترنسك  وهي مثلا زي الهايت  ف بخلي  التشايلد بتاعنا يستني الاول  يحسب الهايت بتاع اكبر ايتم  وهوا يحدد الهايت ع اساس 
// الايتم دي   وعندنا الانترنسك ويدث برده  ودا يعني بقوله انا عايز احسب 
// الويدث بتاع الايتم دي بناء علي الويدث بتاع التشيلدرن بتوعه
// يعني شوفلي اكبر ويدث كام  وعلي اساس الويدث دا بحدد قيمتي انا 


// لما حطينا الهايت بتاع الليست فيو ب 500  هتلاقي ان الليست فيو اجبرت التشيلدرن بتوعها  ياخدو الهايت دا فيريتكال ودا حل مش  سليم 
//  والمفروض ان الهايت يبقي مساوي للهايت بتاع التشيلدرن  ف فيه طريقتين عشان تحدد الهايت 
//  اول طريقه مش حلوه وهي انك عن طريق الميديا كويري تفضل تلعب لحد ما تظبط والطريقه دي مش حلوه لانها بتعتمد علي الهايت بتاع الشاشه  الي انت فيها 
//  ف الهايت  بتاع الشاشه لو صغر هتلاقي الهايت بتاع الايتم هيصغر برده  ف الهايت ممكن ميتناسبش مع الايتم ف بعض الاوقات وهتلاقي الصوره بيحصلها كروب 
//  ونرجع ونفكر انا ليه اصلا حطيت الهايت بالمنظر دا ؟ لان بعد كدا  لما اجي احط هايت لليست فيو هورزنتال  لازم افكر شويه  انا هحط الهايت علي اساس ايه ؟
//  ف هقولك طريقه تحدد بيها الهايت بتاع الليست فيو بشكل كويس  
//  1- بشوف الهايت بتاع التشايد بتاع الليست فيو لو محدد لها هايت محدد ف بالتالي بشوف الهايت واديها نفس الهايت 
//  2- ببتدي اشوف الايتمز الداخليه  لان لو ركزت معايا هتلاقي ان الايتم الداخليه عباره عن تيكست  والفكره ف كدا ان التيسكت له فيكسد هايت اساسا
//  ف انت عندك اتنين تيكست ويدجت يبقي ببتتكلم ف فيكسد هايت   والصوره لها فيكسد هايت برده 
//  ف بالتالي الي بعمله بشوف الايتمز الي موجوده خصوصا لو كان كولم  واجيب التوتال هايت  مثلا ايتم 150 والتانيه 200 والتاليته ريسبونسف 
//  ف بجمع التوتال كلهم لو كولم  ف دا كدا توتال هايت بتاع الويدجتس الي اقدر احسبلهم الهايت ولو عندي تيكست  بفضل اعمل جس ورك  
//  ف بالتالي هنا معندكش كولم ف هعمل جس واحدد الهايت بتاع التشيلدرن وخلاص  وبرده عشان اضمن  ان الايتم تفضل موجوده بشكل سليم  بحط الليست تايل ف السنتر 
// بحيث لو حصل  وكان الهايت كبير شويه ف الاقي الايتم ف لاسنتر 
// ف مش هتلاحظ ان فيه مشكله والقيمه الي حددتها ثابته هلي فيه مشكهل؟ لا لان التشايلد بتاعي اصلا  القيم بتاعته اصلا ثابته ف باالتاي عمر ما هيحصل مشكله  ف اللايتم هتفضل دايما 
// واخده نفس الهايت
// 
// امتي استخدم الحل دا ؟ لما اكون مجبر  اني استخدم ليست فيو هوريزنتال  فقط لا غير  وامتي مكونش مجبر ؟ بستخدم اليست فيو  دوت بيلدر اساسا  لما يكون عندي  عدد ايتم كبيره جدا
// ف  باتالي بلجا  لها عشان  بيتفال   عليها ليزي بيلدر يعني بتبني الويجدت الي ظاهره ع الشاشه بس  ف بيحسن من الاداء بتاعي  يعني ببني الايتمز الي معروضه بس ع السكرين 
// ف بيتم استخدامها لما يكون عندي عدد كبير جدا  من الايتمز 
//  لكن لنفترض اني مكانش عندي عدد كبير  ولكن هوا سكرولابل بدره لكن مش عدد كبير  زي هنا مثلا  ف بالتالي ممكن فعلا مستخدمش الليست فيو 
//  
//والحل دا مش هيتطلب مني احدد الهايت بتاع الايتم ف هوا تلقائيا هيحدد الهايت بتاع الايتم بناء علي  الايتم الي هتتعرض   ف بالتالي هيكون حل مناسب  نستخدمه لو عندك عدد الايتمز
//  الي هتتعرض بشكل هوريزنتال مش كبير   والطريقه دي هتتم عن طريق استخدام رو ويدجت 
//
//

